class PassportPaperTitles:
    def __init__(self):
        self.passport_number = "№ реставраційного паспорта:\n\n"
        self.inventory_number = "інвентарний № пам'ятки\n\n"
        self.acceptance_number = "Акт приймання\n"
        self.ministry = "\nМіністерство культури та інформаційної політики України"
        self.passport_type = "ПАСПОРТ РЕСТАВРАЦІЇ ПАМ'ЯТКИ ІСТОРІЇ ТА КУЛЬТУРИ (РУХОМОЇ)"
        self.institution = "назва закладу, який здійснює реставрацію"
        self.department = "назва відділу/сектору"
        self.typological = "1. Типологічна приналежність пам'ятки"
        self.definition = "Визначення характер пам'ятки:"
        self.fine_art = "пам'ятка образотворчого мистецтва:"
        self.applied_art = "пам'ятка декоративно-ужиткового мистецтва:"
        self.archeological = "археологічна пам'ятка:"
        self.documentary = "документальна пам'ятка:"
        self.other_object = "інша пам'ятка історії та культури:"
        self.object_owner = "2. Місце постійного зберігання, власник пам'ятки"
        self.attribution_data_from_acceptance_report = "3. Атрибутивні дані про пам'ятку згідно з актом приймання"
        self.clarification = "Уточнення в процесі реставрації"
        self.author = "Автор: "
        self.object_name = "Назва: "
        self.time_of_creation = "Час створення: "
        self.material = "Матеріал, основа: "
        self.technique = "Техніка виконання: "
        self.object_size = "Розміри: "
        self.weight = "Вага: "
        self.reason = "4. Підстава для проведення реставраційних заходів"
        self.dates = "Дати"
        self.restorers = "Реставратори"
        self.object_input_date = "Дата передання: "
        self.execute_restorer = "Виконавець: "
        self.object_output_date = "Дата завершення: "
        self.responsible_restorer = "Керівник: "
        self.origin_description = '''5. Основні дані з історії пам'ятки (довідка про побутування; 
відомості про умови зберігання, попередні дослідження, консерваційно-реставраційні заходи тощо), 
джерело надходження інформації'''
        self.condition_before_restoration = "6. Стан пам'ятки до реставрації"
        self.appearance_description = "6.1 За візуальним спостереженням:"
        self.damages_description = "6.1.2 Втрати та пошкодження:"
        self.signs_description = "6.1.3 Старі номери та позначення:"
        self.size_description = "6.1.4 Розміри:"
        self.researches = "6.2. За даними лабораторних досліджень:"
        self.purposes_researches = "Мета дослідження"
        self.methods_researches = "Методи і результати дослідження"
        self.executor_date_researches = "Виконавець та дата"
        self.results_researches = "6.3 Загальний висновок за результатами досліджень:"
        self.restoration_program = "7. Програма проведення реставраційних заходів та їх обгрунтування:"
        self.sequence_of_treatments = "Послідовність заходів"
        self.program_approved_meeting = '''Програма затверджена на засіданні науково-реставраційної/реставраційної ради
____________________________________________________________________________________________________
місце проведення ради (назва закладу)'''
        self.approved_meeting_protocol_number = "Протокол №____ від '     '_______________ 20___р."
        self.appointed_responsible_restorer = "Керівником роботи призначено (ПІБ):___________________________________________________________"
        self.meeting_secretary = "Голова або секретар науково-реставраційної/реставраційної ради (ПІБ):__________________________________________________________________________________________________"
        self.reapproved_restoration_program = "8. Зміни в програмі реставраційних заходів та їх обгрунтування:\n"
        self.reapproved_program_meeting_place = '''Зміни в програмі затверджені на засіданні науково-реставраційної/реставраційної ради
_______________________________________________________________________________________________________
місце проведення ради (назва закладу)'''
        self.reapproved_meeting_protocol_number = "Протокол №____ від '     '_______________ 20___р."
        self.treatments = "9. Проведення реставраційних заходів:"
        self.treatments_descriptions = "Опис операцій із зазначенням методу, методики, технології, інструментарію"
        self.treatments_chemicals = "Матеріали, хімікати (концентрація %)"
        self.treatments_executor_date = "Виконавець та дата"
        self.treatments_results = "10. Стислий опис реставраційних заходів; опис змін технічного та " \
                                  "зовнішнього стану пам'ятки після реставрації, уточнення атрибуції тощо:"
        self.responsible_restorer_signature = "Керівник роботи (ПІБ та підпис):"
        self.execute_restorer_signature = "Виконавець (ПІБ та підпис):"
        self.meeting_conclusion = "\n\n\n\n\n\n11. Висновок науково-реставраційної/реставраційної ради (витяг з протоколу)"
        self.meeting_place = '''
____________________________________________________________________________________________________
____________________________________________________________________________________________________
____________________________________________________________________________________________________
місце проведення ради (назва закладу)'''
        self.after_restoration_meeting_protocol_number = "Протокол №____ від '     '_______________ 20___р."
        self.recommendations = "12. Рекомендації щодо умов зберігання пам'ятки"
        self.illustrative_material = "13. Ілюстративний матеріал:"
        self.before_restoration_image_description = 'Мал.1. "До реставрації": '
        self.process_restoration_image_description = 'Мал.2. "В процесі реставрації": '
        self.after_restoration_image_description = 'Мал.3. "Після реставрації"'
        self.appendix = '14. Додатки до паспорта: '
        self.related_materials = 'ілюстративний матеріал, результати дослідження тощо'
        self.photos = "фотовідбитки"
        self.map_schemes = "картосхеми"
        self.additional_researches_results = 'результати дослідження'
        self.other_related_materials = 'інше (зазначити)'
        self.attachment_illustrative_material_place = '\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n' \
                                                      'місце клапана для\nматеріалів додатка\n\n\n'
        self.object_transferred_place = '''Після реставрації пам'ятка передана в:
____________________________________________________________________________________________________
назва організації, № і дата акту про передачу'''
        self.responsible_treasurer_and_storage_place = '''
____________________________________________________________________________________________________
назва фондової групи, відповідальний хранитель'''
        self.give_back_report = "Акт повернення №____ від '     '_______________ 20___р."
        self.passport_copies_transferred_place = '''
Копії паспорту в 2-х прим. передані в:
____________________________________________________________________________________________________
назва організації, № накладної і дата передачі паспортів'''
        self.head_of_institution = 'Керівник організації:'
        self.head_of_the_department = 'Завідувач відділу:'
        self.head_of_restoration = 'Керівник роботи:'
        self.executor_of_restoration = 'Виконавець роботи:'
        self.restorers_and_other_executors = 'Реставратори та інші виконавці:'
        self.other_executors_signature = '''
М.П._______________________________________________________________________________________________
____________________________________________________________________________________________________
____________________________________________________________________________________________________
(ПІБ), посада, кваліфікаційна категорія, підпис'''
        self.condition_check_date = 'Дата огляду'
        self.condition_description = "Стан пам'ятки"
        self.storage_condition = 'Умови зберігання'
        self.checking_person_signature = 'Посада, ПІБ, підпис'
