class AppearanceDescription:
    def __init__(self):
        self.general_appearance_description = '''За візуальним спостереженням: ...
I. Візуальне дослідження (опис пам’ятки):
    1.Вказати назву (якщо є спеціальний термін).
    2.Описати форму та колір.
II. Описати вигляд предмета:
    1. Складові предмета, їх геометрична форма;
III. Забруднення:
    1.Нестійкі (пилові, брудові, ґрунтові) .
    2.Стійкі (вапнякові, природні та синтетичні смоли, висоли, гіпсові забруднення, плями кислів металів, сліди кіптяви,
        пеку, жиру, плями від пластиліну, масляної фарби, воску, клейові забруднення, чорнила, туш,
        записи фарбами (якого кольору), забруднення фарбами  від попередніх тонувань – місцезнаходження фарби,
        забруднення на зламах фрагментів (від клею, вапнякових нашарувань, пило брудові, ґрунтові і т.д.).
    3.Визначити за візуальним спостереженням яким клеєм склеєно фрагменти (клеєм БФ (світло-коричневого, коричневого, червоного кольору, прозорий),
        ПВА (полівінилацетатний клей молочного кольору, непрозорий, безбарвний, прозорий)
Визначити форму забруднення (у вигляді локальних плям, неправильної форми, повсюдно, забруднення якоїсь частини пам’ятки).
    Матеріали:'''
        self.general_damages_description = '''ІV. Попередня реставрація:
    1. Якщо була – описати якість попередньої реставрації).
    2. Свідчення про попередню реставрацію (відсутні, якщо є вказати джерело чи з чиїх слів записано).
    3. Реставрація не повна якщо:
        -  фрагменти склеєні, а втрати не восповнені;
        -восповнені частково;
        -є втрати у будь-якій частині виробу (вказати місце втрати, форму, розмір).
V. Опис наявних втрат та пошкоджень:
    1. Вказати із якої кількості фрагментів складається пам’ятка.
    2. Вказати на якість попереднього склеювання, доповнення.
    3. Вказати які частини пам’ятки відсутні (вказати розмір в см/мм та кв. см/мм).
    4. Вказати пошкодження, відслоюваня, розшарування, деформації.
    5. Визначити дефекти:
        -привнесені від археологічного чи реставраційного інструменту, помітки олівцем і т.д.;
        -виробничі;
        -тріщини (наскрізні, не наскрізні, волосяні (вказати форму, розмір, розташування);
        -сколи, вибоїни, незначні втрати, каверни, пробоїни, викришування, потертості, подряпини (вказати форму, розмір, розташування);
        -визначити дефекти тонувань (якщо є розпис, консерваційного покриття – описати колір, стан збереження,
        наявні значні або незначні, часткові, локальні втрати, потертості відшарування (вказати форму, розмір, розташування);
VІ. Біологічні пошкодження і руйнування:
    6.Бактерії, гриби та продукти їх життєдіяльності.'''